//显示初始化小人的位置，四个箱子的位置，还有洞的位置，还有迷宫的位置
//将迷宫输出出来
//走一个校区一个位置，并且将走路的方法写出来
//没走一次就重新出一遍表的位置
#include<stdio.h>
#include<stdlib.h>
#include<windows.h>
#include<conio.h>
int main()
{
    int i,cin,  // 给出小人初始坐标
    x=4, y=5,
    // 给出箱子的初始坐标
    x1=3, y1=4,
    x2=4, y2=4,
    x3=5, y3=5,
    x4=4, y4=7,
    // 给出四个目标坐标
    p1=1, q1=4,
    p2=4, q2=1,
    p3=7, q3=5,
    p4=4 ,q4=9;
    char a[50][50]=
    {
        "   ###     ",
        "   #*#     ",
        "   # #     ",
        "####o######",
        "#*  oS o *#",
        "#####o#####",
        "    # #    ",
        "    #*#    ",
        "    ###    "
    };
    for(i =0;i<=20;i++)
    {
        puts(a[i]);
    }
    while( a[1][4] != '@' || a[4][1] != '@' || a[7][5] != '@' || a[4][9] != '@')
    {
        cin = getch(  );
        if( cin =='s' )
        {
            if ( a[x+1][y] != '#')
            {
               if(a[x+1][y] !='o'&& a[x+1][y] !='@') 
               {
                a[x][y] =' ';
                x++;
                a[x][y] ='S';
               }
               else{
                if(a[x+2][y] != '#')
                {
                    if(a[x+2][y] != '*')
                    {
                        a[x][y]=' ';
                         a[x+1][y]=' ';
                          x++;
                        a[x][y]='S';
                       
                        a[x+1][y]='o';
                    }
                    else{
                         a[x][y]=' ';
                         a[x+1][y]=' ';
                          x++;
                        a[x][y]='S';
                       
                        a[x+1][y]='@';
                    }
                }
               }
               
            }
        }   
        if( cin =='w' )
        {
            if ( a[x-1][y] != '#')
            {
               if(a[x-1][y] !='o'&& a[x-1][y] !='@') 
               {
                a[x][y] =' ';
                x--;
                a[x][y] ='S';
               }
               else{
                if(a[x-2][y] != '#')
                {
                    if(a[x-2][y] != '*')
                    {
                        a[x][y]=' ';
                         a[x-1][y]=' ';
                          x--;
                        a[x][y]='S';
                       
                        a[x-1][y]='o';
                    }
                    else{
                         a[x][y]=' ';
                         a[x-1][y]=' ';
                          x--;
                        a[x][y]='S';
                       
                        a[x-1][y]='@';
                    }
                }
               }
               
            }
        }  
        if( cin =='a' )
        {
            if ( a[x][y-1] != '#')
            {
               if(a[x][y-1] !='o'&& a[x][y-1] !='@') 
               {
                a[x][y] =' ';
                y--;
                a[x][y] ='S';
               }
               else{
                if(a[x][y-2] != '#')
                {
                    if(a[x][y-2] != '*')
                    {
                       a[x][y]=' ';
                         a[x][y-1]=' ';
                          y--;
                        a[x][y]='S';
                       
                        a[x][y-1]='o';
                    }
                    else{
                         a[x][y]=' ';
                         a[x][y-1]=' ';
                          y--;
                        a[x][y]='S';
                       
                        a[x][y-1]='@';
                    }
                }
               }
               
            }
        }  
        if( cin =='d' )
        {
            if ( a[x][y+1] != '#')
            {
               if(a[x][y+1] !='o'&& a[x][y+1] !='@') 
               {
                a[x][y] =' ';
                y++;
                a[x][y] ='S';
               }
               else{
                if(a[x][y+2] != '#')
                {
                    if(a[x][y+2] != '*')
                    {
                        a[x][y]=' ';
                         a[x][y+1]=' ';
                          y++;
                        a[x][y]='S';
                       
                        a[x][y+1]='o';
                    }
                    else{
                         a[x][y]=' ';
                         a[x][y+1]=' ';
                          y++;
                        a[x][y]='S';
                       
                        a[x][y+1]='@';
                    }
                }
               }
               
            }
        }  
        system("cls");
        for(i =0;i<=20;i++)
    {
        puts(a[i]);
    }



    }
    system("cls");
    printf("你赢了\n");
    Sleep(10000);
    return 0;
}